In [29]:
import seaborn as sns

In [30]:
df = sns.load_dataset('titanic', engine='python', encoding='euc-kr')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

### 후보군 pclass, sex, sibsp, parch,embarked, class, who, adult_male, embark_town, alive, alone

In [31]:
import pandas as pd

dfx = pd.get_dummies(df['sex'])
# sex: female:0. male:1 
dfx

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [32]:
df = pd.concat([df, dfx], axis = 1)
df

     survived  pclass     sex   age  ...  alive  alone  female male
0           0       3    male  22.0  ...     no  False       0    1
1           1       1  female  38.0  ...    yes  False       1    0
2           1       3  female  26.0  ...    yes   True       1    0
3           1       1  female  35.0  ...    yes  False       1    0
4           0       3    male  35.0  ...     no   True       0    1
..        ...     ...     ...   ...  ...    ...    ...     ...  ...
886         0       2    male  27.0  ...     no   True       0    1
887         1       1  female  19.0  ...    yes   True       1    0
888         0       3  female   NaN  ...     no  False       1    0
889         1       1    male  26.0  ...    yes   True       0    1
890         0       3    male  32.0  ...     no   True       0    1

[891 rows x 17 columns]

# y(servive) = ax(pclass) + 0
# y + 0.42x
# y = 0*x1 + 0*x2 + 1*x3 --> 3번째
# y = 1*x1 + 0*x2 + 0*x3 --> 1번째

In [43]:
dfx2 = pd.get_dummies(df['pclass'], prefix='pclass', drop_first=True)
pd.concat([dfx, dfx2], axis = 1)
df.head(4)

   survived  pclass     sex   age  ...  alive  alone  female male
0         0       3    male  22.0  ...     no  False       0    1
1         1       1  female  38.0  ...    yes  False       1    0
2         1       3  female  26.0  ...    yes   True       1    0
3         1       1  female  35.0  ...    yes  False       1    0

[4 rows x 17 columns]

In [42]:
df[['fare', 'female', 'male', 'survived']].head(5)

      fare  female  male  survived
0   7.2500       0     1         0
1  71.2833       1     0         1
2   7.9250       1     0         1
3  53.1000       1     0         1
4   8.0500       0     1         0

In [55]:
X = df[['fare', 'female', 'male', 'survived']].head(5)
Y = df[['survived']]
X.shape, Y.shape

((5, 4), (891, 1))

In [56]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [57]:
X = scaler.transform(X)
X.shape

(5, 4)

In [64]:
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(X, Y)

ValueError: ignored

In [52]:
from sklearn.linear_model import LogisticRegression

In [53]:
logR = LogisticRegression

In [63]:
logR.fit(x_train, y_train)

NameError: ignored

In [62]:
logR.score(x_train, y_train)

NameError: ignored